# На вход программе подается натуральное число n.
# Напишите программу, которая печатает звездный прямоугольник размерами ×19 n×19.

n = int(input())
for i in range(n):
    print("*******************")