# Дано предложение и количество раз которое его надо повторить.
# Напишите программу, которая повторяет данное предложение нужное количество раз.

str1 = input()
count = int(input())
for i in range(count):
    print(str1)