# Две старушки идут навстречу друг другу с постоянными скоростями V1  V2
# Определите, через какое время старушки встретятся, если расстояние между ними равно S

v1 = float(input())
v2 = float(input())
s = float(input())
t = s / (v1 + v2)
print(t)