# Даны пять чисел. Напишите программу, которая вычисляет сумму их модулей

a1 = float(input())
a2 = float(input())
a3 = float(input())
a4 = float(input())
a5 = float(input())

abs1 = abs(a1)
abs2 = abs(a2)
abs3 = abs(a3)
abs4 = abs(a4)
abs5 = abs(a5)

print(abs1 + abs2 + abs3 + abs4 + abs5)