# Напишите программу, которая считывает одну строку, после чего выводит «YES»,
# если в введенной строке есть подстрока «синий» и «NO» в противном случае.

str1 = input()
if "синий" in str1:
    print("YES")
else:
    print("NO")