# Дано положительное действительное число. Выведите его дробную часть.

number = float(input())
digit = number - int(number)
print(digit)